---
kind: type
id: T:Autodesk.Revit.DB.Structure.RebarShapeDefinitionByArc
source: html/a92742a5-9781-3691-ec78-5b318fbf5ad3.htm
---
# Autodesk.Revit.DB.Structure.RebarShapeDefinitionByArc

Definition of a shape whose size and position can determined by a single arc.

## Syntax (C#)
```csharp
public class RebarShapeDefinitionByArc : RebarShapeDefinition
```

## Remarks
In this shape definition, all dimensions are allowed to be driving dimensions.